In [11]:
import pandas as pd
import numpy as np

data = {
    "Name": ["Aarav", "Vihaan", "Vivaan", "Aditya", np.nan, "Ananya", "Ishaan"],
    "Age": [25, 28, np.nan, 29, 22, 27, 26],
    "Gender": ["Male", "Male", "Male", np.nan, "Female", "Female", "Male"],
    "City": ["Mumbai", np.nan, "Bangalore", "Hyderabad", "Chennai", "Kolkata", "Pune"],
    "Salary": [70000, 80000, 75000, np.nan, 62000, 68000, np.nan],
}

df = pd.DataFrame(data)
print(df)

     Name   Age  Gender       City   Salary
0   Aarav  25.0    Male     Mumbai  70000.0
1  Vihaan  28.0    Male        NaN  80000.0
2  Vivaan   NaN    Male  Bangalore  75000.0
3  Aditya  29.0     NaN  Hyderabad      NaN
4     NaN  22.0  Female    Chennai  62000.0
5  Ananya  27.0  Female    Kolkata  68000.0
6  Ishaan  26.0    Male       Pune      NaN

In [4]:
df.dropna()

     Name   Age  Gender     City   Salary
0   Aarav  25.0    Male   Mumbai  70000.0
5  Ananya  27.0  Female  Kolkata  68000.0

In [14]:
df.at[4, 'Name'] = 'Shreya'
df.at[1, 'City'] = 'Delhi'
df.loc[2, 'Age'] = 30
df.at[3, 'Salary'] = 72000
df.at[6, 'Salary'] = 75000
df.loc[3, 'Gender'] = 'Male'
print(df)

     Name   Age  Gender       City   Salary
0   Aarav  25.0    Male     Mumbai  70000.0
1  Vihaan  28.0    Male      Delhi  80000.0
2  Vivaan  30.0    Male  Bangalore  75000.0
3  Aditya  29.0    Male  Hyderabad  72000.0
4  Shreya  22.0  Female    Chennai  62000.0
5  Ananya  27.0  Female    Kolkata  68000.0
6  Ishaan  26.0    Male       Pune  75000.0

In [16]:
mean_age = df['Age'].mean()
mean_salary = df['Salary'].mean()

print("Mean Age:", mean_age)
print("Mean Salary:", mean_salary)

Mean Age: 26.714285714285715
Mean Salary: 71714.28571428571

In [18]:
for x in df.index:
    if df.loc[x, 'Salary'] >= 65000:
        print(df.loc[x, ['Name', 'Salary']])

Name        Aarav
Salary    70000.0
Name: 0, dtype: object
Name       Vihaan
Salary    80000.0
Name: 1, dtype: object
Name       Vivaan
Salary    75000.0
Name: 2, dtype: object
Name       Aditya
Salary    72000.0
Name: 3, dtype: object
Name       Ananya
Salary    68000.0
Name: 5, dtype: object
Name       Ishaan
Salary    75000.0
Name: 6, dtype: object

In [19]:
print(df)

     Name   Age  Gender       City   Salary
0   Aarav  25.0    Male     Mumbai  70000.0
1  Vihaan  28.0    Male      Delhi  80000.0
2  Vivaan  30.0    Male  Bangalore  75000.0
3  Aditya  29.0    Male  Hyderabad  72000.0
4  Shreya  22.0  Female    Chennai  62000.0
5  Ananya  27.0  Female    Kolkata  68000.0
6  Ishaan  26.0    Male       Pune  75000.0